## Intro
* Used to Store data in dataframes
* Used to clean, manipulate data
* Helps you work on different data sources like .csv, .txt, .xlx, MySQL, NoSQL, Cloud Storagesâ€¦

## Two main data structures in Pandas 
* One dimensional called as Series
* Two dimensional called as DataFrames

In [2]:
import pandas as pd 
pd.Series

0    1
dtype: int64

In [6]:
pd.Series(list(range(5,50,5)), name='First Series')

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
Name: First Series, dtype: int64

In [7]:
my_dict = {'apples':10, 'cucumbers':20, 'bread':30, 'bacon':40, 'water':2}

In [12]:
my_series=pd.Series(my_dict, name='groceries')

In [14]:
my_series['apples']

10

In [15]:
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

a          [0, 1, 2, 3, 4, 5]
b        [0, 1, 4, 9, 16, 25]
c    [-1, -2, -3, -4, -5, -6]
dtype: object

## Attributes in Series

In [17]:
s=pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, \
             'water':5, 'sunscreen':1, 'baby wipes':1, 'bug spray':2, \
             'blanket':1, 'beer':10, 'wine':1, 'bottle opener':2, \
             'knife':1, 'towel':2, 'trash bags':5, 'ice packs':2, \
             'camera':1, 'board games':2}, name='picnic')
s

apples           10
cucumbers         3
bread             2
bacon             5
water             5
sunscreen         1
baby wipes        1
bug spray         2
blanket           1
beer             10
wine              1
bottle opener     2
knife             1
towel             2
trash bags        5
ice packs         2
camera            1
board games       2
Name: picnic, dtype: int64

In [18]:
# check data type
s.dtype

dtype('int64')

In [19]:
# check for null values
s.hasnans

False

In [20]:
# fetch index 
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'sunscreen',
       'baby wipes', 'bug spray', 'blanket', 'beer', 'wine', 'bottle opener',
       'knife', 'towel', 'trash bags', 'ice packs', 'camera', 'board games'],
      dtype='object')

In [21]:
# fetch values
s.values

array([10,  3,  2,  5,  5,  1,  1,  2,  1, 10,  1,  2,  1,  2,  5,  2,  1,
        2])

In [22]:
# number of rows 
s.size

18

In [23]:
# get the name 
s.name

'picnic'

## Indexing

In [26]:
# get first rows (default =5)
s.head(10)

apples        10
cucumbers      3
bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [27]:
# get last rows (default =5)
s.tail()

towel          2
trash bags     5
ice packs      2
camera         1
board games    2
Name: picnic, dtype: int64

In [29]:
# get random samples
s.sample(4)

camera         1
apples        10
trash bags     5
bug spray      2
Name: picnic, dtype: int64

In [30]:
# fetch value based on index
s.water

5

In [35]:
s[['knife','towel']]

knife    1
towel    2
Name: picnic, dtype: int64

In [36]:
s['bread':'beer']

bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [37]:
s.loc['bread':'beer']

bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [38]:
## locate with the index number
s.iloc[1]

3

In [39]:
s.iloc[1:5]

cucumbers    3
bread        2
bacon        5
water        5
Name: picnic, dtype: int64

# DataFrames

In [40]:
pd.DataFrame(list(range(5,50,5)))

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45

In [44]:
pd.DataFrame(list(range(5,50,5)), columns=['Col 1'])

   Col 1
0      5
1     10
2     15
3     20
4     25
5     30
6     35
7     40
8     45

In [49]:
## Create a df from a list of lists 
my_list=[[i for i in range(j,j+5)] for j in range(10)]
pd.DataFrame(my_list, columns = ['1', '2','3','4','5'])

   1   2   3   4   5
0  0   1   2   3   4
1  1   2   3   4   5
2  2   3   4   5   6
3  3   4   5   6   7
4  4   5   6   7   8
5  5   6   7   8   9
6  6   7   8   9  10
7  7   8   9  10  11
8  8   9  10  11  12
9  9  10  11  12  13

In [53]:
## Transpose dictionniaries 
my_dict = {'apples':[10], 'cucumbers':[20], 'bread':[30], 'bacon':[40], 'water':[2]}

pd.DataFrame(my_dict).T

            0
apples     10
cucumbers  20
bread      30
bacon      40
water       2

In [54]:
#More concrete example
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [57]:
pd.DataFrame(house_dict, index=colnames).T

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [62]:
## Alternate solution

df = pd.DataFrame.from_dict(house_dict,orient='index',columns=colnames)
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

## Attributes

In [63]:
# check data types
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [64]:
# Fetch index

df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [66]:
# Fetch values

df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [67]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [70]:
# (rows, columns)
df.shape

(10, 5)

In [71]:
df.size

50

In [73]:
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [76]:
df.sample(3)

                LotSize Neighborhood  YearBuilt  Quality  SalePrice
Hamilton House     6120      OldTown       1931        7     129900
Snyder House      10084      Somerst       2004        8     307000
Smith House        8450      CollgCr       2003        7     208500

In [77]:
df.Neighborhood

Baker House        BrkSide
Beazley House      Mitchel
Dominguez House    NoRidge
Hamilton House     OldTown
James House        CollgCr
Martinez House     Veenker
Roberts House      Crawfor
Smith House        CollgCr
Snyder House       Somerst
Zuckerman House     NWAmes
Name: Neighborhood, dtype: object

In [79]:
df[['LotSize','YearBuilt']]

                 LotSize  YearBuilt
Baker House         7420       1939
Beazley House      14115       1993
Dominguez House    14260       2000
Hamilton House      6120       1931
James House        11250       2001
Martinez House      9600       1976
Roberts House       9550       1915
Smith House         8450       2003
Snyder House       10084       2004
Zuckerman House    10382       1973

In [85]:
df.loc[['Roberts House','Martinez House']]

                LotSize Neighborhood  YearBuilt  Quality  SalePrice
Roberts House      9550      Crawfor       1915        7     140000
Martinez House     9600      Veenker       1976        6     181500

In [86]:
df.loc[['Roberts House','Martinez House'],['Quality','SalePrice']]

                Quality  SalePrice
Roberts House         7     140000
Martinez House        6     181500

In [87]:
df.iloc[[1,7]]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000
Smith House       8450      CollgCr       2003        7     208500

In [88]:
df.iloc[[1,7],[0,-1]]

               LotSize  SalePrice
Beazley House    14115     143000
Smith House       8450     208500

In [93]:
df.iloc[0:6,0:2]

                 LotSize Neighborhood
Baker House         7420      BrkSide
Beazley House      14115      Mitchel
Dominguez House    14260      NoRidge
Hamilton House      6120      OldTown
James House        11250      CollgCr
Martinez House      9600      Veenker

In [95]:
df['LotSize'].sum()

101231